from scipy.optimize import linprog



c = [1.2, 0.8, 1, 1.3]              # Коэффициенты целевой функции
A = [[1.2, 1.8, 1.6, 2.4],
     [  1, 0.4, 0.8, 0.7],
     [6.4, 5.6,   6,   8],
     [  3,   0, 1.8, 2.4],
     [2.1, 1.5, 0.8,   3]]          # Матрица ограничений
b = [7200, 5600, 11176, 3600, 4200] # Вектор-столбец свободных членов

bounds = [(0, None), (0, None), (0, None), (0, None)] # Неотрицательные иксы

c = [(i * -1) for i in c]



result = linprog(c, A_ub=A, b_ub=b, bounds=bounds)    # Нахождение оптимального решения

print("Оптимальное решение:",         result.x)
print("Значение целевой функции:", -result.fun)
